final Map<String, Map<String, dynamic>> azkarAsbah = {
  'آية الكرسي': {
    'النص':
        'اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ [آية الكرسى - البقرة 255]',
    'عدد التكرار': 1,
  },
  'سورة الإخلاص': {
    'النص':
        'بسم الله الرحمن الرحيم\nقُلۡ هُوَ ٱللَّهُ أَحَدٌ (1) ٱللَّهُ ٱلصَّمَدُ (2) لَمۡ يَلِدۡ وَلَمۡ يُولَدۡ (3) وَلَمۡ يَكُن لَّهُۥ كُفُوًا أَحَدُۢ (4)',
    'عدد التكرار': 3,
  },
  'سورة الفلق': {
    'النص':
        'بسم الله الرحمن الرحيم\nقُلۡ أَعُوذُ بِرَبِّ ٱلۡفَلَقِ (1) مِن شَرِّ مَا خَلَقَ (2) وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ (3) وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِي ٱلۡعُقَدِ (4) وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ (5)',
    'عدد التكرار': 3,
  },
  'سورة الناس': {
    'النص':
        'بسم الله الرحمن الرحيم\nقُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ (1) مَلِكِ ٱلنَّاسِ (2) إِلَٰهِ ٱلنَّاسِ (3) مِن شَرِّ ٱلۡوَسۡوَاسِ ٱلۡخَنَّاسِ (4) ٱلَّذِي يُوَسۡوِسُ فِي صُدُورِ ٱلنَّاسِ (5) مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ (6)',
    'عدد التكرار': 3,
  },
  'توحيد الله': {
    'النص':
        'لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ المُلْكُ، وَلَهُ الحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ',
    'عدد التكرار': 1,
  },
  'التسبيح': {'النص': 'سُبْحَانَ اللهِ وَبِحَمْدِهِ', 'عدد التكرار': 100},
  'ذكر رقم 1': {
    'النص':
        'بِسْمِ اللهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ العَلِيمُ',
    'عدد التكرار': 3,
  },
  'ذكر رقم 2': {
    'النص':
        'رَضِيتُ بِاللهِ رَبًّا، وَبِالْإِسْلَامِ دِينًا، وَبِمُحَمَّدٍ ﷺ نَبِيًّا وَرَسُولاً',
    'عدد التكرار': 3,
  },
  'ذكر رقم 3': {
    'النص':
        'حَسْبِيَ اللَّهُ لَا إِلَهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ، وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ',
    'عدد التكرار': 7,
  },
  'ذكر رقم 4': {
    'النص':
        'أَصْبَحْنَا عَلَى فِطْرَةِ الْإِسْلَامِ، وَكَلِمَةِ الْإِخْلَاصِ، وَدِينِ نَبِيِّنَا مُحَمَّدٍ ﷺ، وَمِلَّةِ أَبِينَا إِبْرَاهِيمَ حَنِيفًا مُسْلِمًا وَمَا أَنَا مِنَ الْمُشْرِكِينَ',
    'عدد التكرار': 1,
  },
  'ذكر رقم 5': {
    'النص':
        'أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ، لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ؛ أَسْأَلُكَ خَيْرَ مَا فِي هَذا اليوم وَخَيْرَ مَا بَعْدَه، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذا اليوم وَشَرِّ مَا بَعْدَه، رَبِّ؛ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ؛ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ',
    'عدد التكرار': 1,
  },
  'ذكر رقم 6': {
    'النص':
        'اللَّهُمَّ؛ بِكَ أَصْبَحْنَا، وَبِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ النُّشُورُ',
    'عدد التكرار': 1,
  },
  'ذكر رقم 7': {
    'النص':
        'اللَّهُمَّ؛ إِنِّي أَصبَحتُ أُشْهِدُكَ وَأُشْهِدُ حَمَلَةَ عَرْشِكَ وَمَلائِكَتَكَ وَجَمِيعَ خَلْقِكَ أَنَّكَ أَنْتَ اللَّهُ لا إِلَهَ إِلا أَنْتَ، وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ',
    'عدد التكرار': 4,
  },
  'ذكر رقم 8': {
    'النص':
        'اللَّهمَّ؛ ما أصبَحَ بِي مِن نِعمَةٍ فَمِنكَ وَحدَكَ لا شَرِيكَ لَك، لَكَ الحَمدُ، ولَكَ الشَّكرُ',
    'عدد التكرار': 1,
  },
  'ذكر رقم 9': {
    'النص':
        'يَا حَيُّ يَا قَيُّومُ؛ بِكَ أَسْتَغِيثُ، فَأَصْلِحْ لِي شَأْنِي كُلَّهُ، وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ',
    'عدد التكرار': 1,
  },
  'ذكر رقم 10': {
    'النص':
        'اللَّهُمَّ؛ عَافِنِي فِي بَدَنِي، اللَّهُمَّ؛ عَافِنِي فِي سَمْعِي، اللَّهُمَّ؛ عَافِنِي فِي بَصَرِي، اللَّهُمَّ؛ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، اللَّهُمَّ؛ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلَهَ إِلَّا أَنْتَ',
    'عدد التكرار': 3,
  },
  'ذكر رقم 11': {
    'النص':
        'اللَّهُمَّ؛ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ، اللَّهُمَّ؛ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي، اللَّهُمَّ؛ اسْتُرْ عَوْرَاتِي، وَآمِنْ رَوْعَاتِي، اللَّهُمَّ؛  احْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِي، وَعَنْ يَمِينِي وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي',
    'عدد التكرار': 1,
  },
  'ذكر رقم 12': {
    'النص':
        'اللَّهُمَّ؛ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَشَرِّ الشَّيْطَانِ وَشِرْكِهِ',
    'عدد التكرار': 1,
  },
  'ذكر رقم 13': {
    'النص':
        'اللَّهُمَّ؛ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا',
    'عدد التكرار': 1,
  },
  'ذكر رقم 14': {
    'النص':
        'اللَّهُمَّ؛ أَنْتَ رَبِّي، لاَ إِلَهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي؛ فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ',
    'عدد التكرار': 1,
  },
};

final Map<String, Map<String, dynamic>> azkarAlmasa = {
  'آية الكرسي': {
    'النص':
        'اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ [آية الكرسى - البقرة 255]',
    'عدد التكرار': 1,
  },
  'سورة الإخلاص': {
    'النص':
        'بسم الله الرحمن الرحيم\nقُلۡ هُوَ ٱللَّهُ أَحَدٌ (1) ٱللَّهُ ٱلصَّمَدُ (2) لَمۡ يَلِدۡ وَلَمۡ يُولَدۡ (3) وَلَمۡ يَكُن لَّهُۥ كُفُوًا أَحَدُۢ (4)',
    'عدد التكرار': 3,
  },
  'سورة الفلق': {
    'النص':
        'بسم الله الرحمن الرحيم\nقُلۡ أَعُوذُ بِرَبِّ ٱلۡفَلَقِ (1) مِن شَرِّ مَا خَلَقَ (2) وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ (3) وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِي ٱلۡعُقَدِ (4) وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ (5)',
    'عدد التكرار': 3,
  },
  'سورة الناس': {
    'النص':
        'بسم الله الرحمن الرحيم\nقُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ (1) مَلِكِ ٱلنَّاسِ (2) إِلَٰهِ ٱلنَّاسِ (3) مِن شَرِّ ٱلۡوَسۡوَاسِ ٱلۡخَنَّاسِ (4) ٱلَّذِي يُوَسۡوِسُ فِي صُدُورِ ٱلنَّاسِ (5) مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ (6)',
    'عدد التكرار': 3,
  },
  'توحيد الله': {
    'النص':
        'لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ المُلْكُ، وَلَهُ الحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ',
    'عدد التكرار': 1,
  },
  'التسبيح': {'النص': 'سُبْحَانَ اللهِ وَبِحَمْدِهِ', 'عدد التكرار': 100},
  'ذكر رقم 1': {
    'النص':
        'بِسْمِ اللهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ العَلِيمُ',
    'عدد التكرار': 3,
  },
  'ذكر رقم 2': {
    'النص': 'أَعُوذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ',
    'عدد التكرار': 3,
  },
  'ذكر رقم 3': {
    'النص':
        'رَضِيتُ بِاللهِ رَبًّا، وَبِالْإِسْلَامِ دِينًا، وَبِمُحَمَّدٍ ﷺ نَبِيًّا وَرَسُولاً',
    'عدد التكرار': 3,
  },
  'ذكر رقم 4': {
    'النص':
        'حَسْبِيَ اللَّهُ لَا إِلَهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ، وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ',
    'عدد التكرار': 7,
  },
  'ذكر رقم 5': {
    'النص':
        'أَمسَينَا عَلَى فِطْرَةِ الْإِسْلَامِ، وَكَلِمَةِ الْإِخْلَاصِ، وَدِينِ نَبِيِّنَا مُحَمَّدٍ ﷺ، وَمِلَّةِ أَبِينَا إِبْرَاهِيمَ حَنِيفًا مُسْلِمًا وَمَا أَنَا مِنَ الْمُشْرِكِينَ',
    'عدد التكرار': 1,
  },
  'ذكر رقم 6': {
    'النص':
        'أَمسَينَا وَأَمسَى الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ، لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ؛ أَسْأَلُكَ خَيْرَ مَا فِي هَذهِ اللَّيْلَةِ وَخَيْرَ مَا بَعْدَهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذهِ اللَّيْلَةِ وَشَرِّ مَا بَعْدَهَا، رَبِّ؛ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ؛ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ',
    'عدد التكرار': 1,
  },
  'ذكر رقم 7': {
    'النص':
        'اللَّهُمَّ؛ بِكَ أَمسَينَا، وَبِكَ أَصْبَحْنَا وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ المَصِيرُ',
    'عدد التكرار': 1,
  },
  'ذكر رقم 8': {
    'النص':
        'اللَّهُمَّ؛ إِنِّي أَمْسَيْتُ أُشْهِدُكَ وَأُشْهِدُ حَمَلَةَ عَرْشِكَ وَمَلائِكَتَكَ وَجَمِيعَ خَلْقِكَ أَنَّكَ أَنْتَ اللَّهُ لا إِلَهَ إِلا أَنْتَ، وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ',
    'عدد التكرار': 4,
  },
  'ذكر رقم 9': {
    'النص':
        'اللَّهمَّ؛ ما أَمْسَى بِي مِن نِعمَةٍ فَمِنكَ وَحدَكَ لا شَرِيكَ لَك، لَكَ الحَمدُ، ولَكَ الشَّكرُ',
    'عدد التكرار': 1,
  },
  'ذكر رقم 10': {
    'النص':
        'يَا حَيُّ يَا قَيُّومُ؛ بِكَ أَسْتَغِيثُ، فَأَصْلِحْ لِي شَأْنِي كُلَّهُ، وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ',
    'عدد التكرار': 1,
  },
  'ذكر رقم 11': {
    'النص':
        'اللَّهُمَّ؛ عَافِنِي فِي بَدَنِي، اللَّهُمَّ؛ عَافِنِي فِي سَمْعِي، اللَّهُمَّ؛ عَافِنِي فِي بَصَرِي، اللَّهُمَّ؛ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، اللَّهُمَّ؛ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلَهَ إِلَّا أَنْتَ',
    'عدد التكرار': 3,
  },
  'ذكر رقم 12': {
    'النص':
        'اللَّهُمَّ؛ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ، اللَّهُمَّ؛ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي، اللَّهُمَّ؛ اسْتُرْ عَوْرَاتِي، وَآمِنْ رَوْعَاتِي، اللَّهُمَّ؛  احْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِي، وَعَنْ يَمِينِي وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي',
    'عدد التكرار': 1,
  },
  'ذكر رقم 13': {
    'النص':
        'اللَّهُمَّ؛ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَشَرِّ الشَّيْطَانِ وَشِرْكِهِ',
    'عدد التكرار': 1,
  },
  'ذكر رقم 14': {
    'النص':
        'اللَّهُمَّ؛ أَنْتَ رَبِّي، لاَ إِلَهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي؛ فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ',
    'عدد التكرار': 1,
  },
};

const List<String> withNames = [
  'أحمد دريعي',
  'أويس معتوق',
  'بدر الرفاعي',
  'حازم كيالي',
  'خالد الرفاعي',
  'سارية معتوق',
  'عبادة السعدي',
  'عبيدة عكش',
  'عبدالرحمن أبو سعدة',
  'عبدالرحمن الداهن',
  'عبدالرحمن رعد',
  'عروة السعدي',
  'عمر السعدي',
  'عمرو عيسى',
  'فايز الحاج',
  'مجد سويد',
  'محمود الداهن',
  'زيد الرفاعي',
];

const List<String> toNames = [
  'أستاذ أبو عبيدة',
  'أستاذ عبدالرحمن الخن',
  'أحمد دريعي',
  'أويس معتوق',
  'بدر الرفاعي',
  'حازم كيالي',
  'خالد الرفاعي',
  'سارية معتوق',
  'عبادة السعدي',
  'عبيدة عكش',
  'عبدالرحمن أبو سعدة',
  'عبدالرحمن الداهن',
  'عبدالرحمن رعد',
  'عروة السعدي',
  'عمر السعدي',
  'عمرو عيسى',
  'فايز الحاج',
  'مجد سويد',
  'محمود الداهن',
  'زيد الرفاعي',
  'فرد من العائلة',
  'شخص اخر',
];

const List<String> userNames = [
  'أستاذ أبو عبيدة',
  'أستاذ عبدالرحمن الخن',
  'أحمد دريعي',
  'أويس معتوق',
  'بدر الرفاعي',
  'حازم كيالي',
  'خالد الرفاعي',
  'سارية معتوق',
  'عبادة السعدي',
  'عبيدة عكش',
  'عبدالرحمن أبو سعدة',
  'عبدالرحمن الداهن',
  'عبدالرحمن رعد',
  'عروة السعدي',
  'عمر السعدي',
  'عمرو عيسى',
  'فايز الحاج',
  'مجد سويد',
  'محمود الداهن',
  'زيد الرفاعي',
];

final List<String> ijazahStudents = [
  'أحمد دريعي',
  'أويس معتوق',
  'بدر الرفاعي',
  'حازم كيالي',
  'خالد الرفاعي',
  'سارية معتوق',
  'عبادة السعدي',
  'عبيدة عكش',
  'عبدالرحمن أبو سعدة',
  'عبدالرحمن الداهن',
  'عبدالرحمن رعد',
  'عروة السعدي',
  'عمر السعدي',
  'عمرو عيسى',
  'فايز الحاج',
  'مجد سويد',
  'محمود الداهن',
  'زيد الرفاعي',
];

final List<String> recitationStudentsName = [
  'أحمد دريعي',
  'أويس معتوق',
  'بدر الرفاعي',
  'حازم كيالي',
  'خالد الرفاعي',
  'سارية معتوق',
  'عبادة السعدي',
  'عبيدة عكش',
  'عبدالرحمن أبو سعدة',
  'عبدالرحمن الداهن',
  'عبدالرحمن رعد',
  'عروة السعدي',
  'عمر السعدي',
  'عمرو عيسى',
  'فايز الحاج',
  'مجد سويد',
  'محمود الداهن',
  'زيد الرفاعي',
];

final List<String> timeFilters = [
  'منذ انشاء التطبيق',
  'اليوم',
  'الأسبوع',
  'الشهر',
  'ثلاثة أشهر',
  'السنة',
];
