final Map<String, Map<String, dynamic>> azkarAsbah = {
  'آية الكرسي': {
    'النص':
        'الله لا إله إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يؤوده حفظهما وهو العلي العظيم. [آية الكرسى - البقرة 255]',
    'عدد التكرار': 1,
  },
  'سورة الإخلاص': {
    'النص':
        'بسم الله الرحمن الرحيم\nقل هو الله أحد، الله الصمد، لم يلد ولم يولد، ولم يكن لهۥ كفوا أحدۢ.',
    'عدد التكرار': 3,
  },
  'سورة الفلق': {
    'النص':
        'بسم الله الرحمن الرحيم\nقل أعوذ برب الفلق، من شر ما خلق، ومن شر غاسق إذا وقب، ومن شر النفثت فى العقد، ومن شر حاسد إذا حسد.',
    'عدد التكرار': 3,
  },
  'سورة الناس': {
    'النص':
        'بسم الله الرحمن الرحيم\nقل أعوذ برب الناس، ملك الناس، إله الناس، من شر الوسواس الخناس، الذى يوسوس فى صدور الناس، من الجنة والناس.',
    'عدد التكرار': 3,
  },
  'الحديثرقم 1': {
    'النص':
        'لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ المُلْكُ، وَلَهُ الحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ',
    'عدد التكرار': 1,
  },
  'الحديثرقم 2': {'النص': 'سُبْحَانَ اللهِ وَبِحَمْدِهِ', 'عدد التكرار': 100},
  'الحديثرقم 3': {
    'النص':
        'بِسْمِ اللهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ العَلِيمُ',
    'عدد التكرار': 3,
  },
  'الحديثرقم 4': {
    'النص':
        'رَضِيتُ بِاللهِ رَبًّا، وَبِالْإِسْلَامِ دِينًا، وَبِمُحَمَّدٍ ﷺ نَبِيًّا وَرَسُولاً',
    'عدد التكرار': 3,
  },
  'الحديثرقم 5': {
    'النص':
        'حَسْبِيَ اللَّهُ لَا إِلَهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ، وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ',
    'عدد التكرار': 7,
  },
  'الحديثرقم 6': {
    'النص':
        'أَصْبَحْنَا عَلَى فِطْرَةِ الْإِسْلَامِ، وَكَلِمَةِ الْإِخْلَاصِ، وَدِينِ نَبِيِّنَا مُحَمَّدٍ ﷺ، وَمِلَّةِ أَبِينَا إِبْرَاهِيمَ حَنِيفًا مُسْلِمًا وَمَا أَنَا مِنَ الْمُشْرِكِينَ',
    'عدد التكرار': 1,
  },
  'الحديثرقم 7': {
    'النص':
        'أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ، لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ؛ أَسْأَلُكَ خَيْرَ مَا فِي هَذا اليوم وَخَيْرَ مَا بَعْدَه، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذا اليوم وَشَرِّ مَا بَعْدَه، رَبِّ؛ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ؛ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ',
    'عدد التكرار': 1,
  },
  'الحديثرقم 8': {
    'النص':
        'اللَّهُمَّ؛ بِكَ أَصْبَحْنَا، وَبِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ النُّشُورُ',
    'عدد التكرار': 1,
  },
  'الحديثرقم 9': {
    'النص':
        'اللَّهُمَّ؛ إِنِّي أَصبَحتُ أُشْهِدُكَ وَأُشْهِدُ حَمَلَةَ عَرْشِكَ وَمَلائِكَتَكَ وَجَمِيعَ خَلْقِكَ أَنَّكَ أَنْتَ اللَّهُ لا إِلَهَ إِلا أَنْتَ، وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ',
    'عدد التكرار': 4,
  },
  'الحديثرقم 10': {
    'النص':
        'اللَّهمَّ؛ ما أصبَحَ بِي مِن نِعمَةٍ فَمِنكَ وَحدَكَ لا شَرِيكَ لَك، لَكَ الحَمدُ، ولَكَ الشَّكرُ',
    'عدد التكرار': 1,
  },
  'الحديثرقم 11': {
    'النص':
        'يَا حَيُّ يَا قَيُّومُ؛ بِكَ أَسْتَغِيثُ، فَأَصْلِحْ لِي شَأْنِي كُلَّهُ، وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ',
    'عدد التكرار': 1,
  },
  'الحديثرقم 12': {
    'النص':
        'اللَّهُمَّ؛ عَافِنِي فِي بَدَنِي، اللَّهُمَّ؛ عَافِنِي فِي سَمْعِي، اللَّهُمَّ؛ عَافِنِي فِي بَصَرِي، اللَّهُمَّ؛ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، اللَّهُمَّ؛ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلَهَ إِلَّا أَنْتَ',
    'عدد التكرار': 3,
  },
  'الحديثرقم 13': {
    'النص':
        'اللَّهُمَّ؛ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ، اللَّهُمَّ؛ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي، اللَّهُمَّ؛ اسْتُرْ عَوْرَاتِي، وَآمِنْ رَوْعَاتِي، اللَّهُمَّ؛  احْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِي، وَعَنْ يَمِينِي وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي',
    'عدد التكرار': 1,
  },
  'الحديثرقم 14': {
    'النص':
        'اللَّهُمَّ؛ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَشَرِّ الشَّيْطَانِ وَشِرْكِهِ',
    'عدد التكرار': 1,
  },
  'الحديثرقم 15': {
    'النص':
        'اللَّهُمَّ؛ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا',
    'عدد التكرار': 1,
  },
  'الحديثرقم 16': {
    'النص':
        'اللَّهُمَّ؛ أَنْتَ رَبِّي، لاَ إِلَهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي؛ فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ',
    'عدد التكرار': 1,
  },
};

final Map<String, Map<String, dynamic>> azkarAlmasa = {
  'آية الكرسي': {
    'النص':
        'الله لا إله إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يؤوده حفظهما وهو العلي العظيم. [آية الكرسى - البقرة 255]',
    'عدد التكرار': 1,
  },
  'سورة الإخلاص': {
    'النص':
        'بسم الله الرحمن الرحيم\nقل هو الله أحد، الله الصمد، لم يلد ولم يولد، ولم يكن لهۥ كفوا أحدۢ.',
    'عدد التكرار': 3,
  },
  'سورة الفلق': {
    'النص':
        'بسم الله الرحمن الرحيم\nقل أعوذ برب الفلق، من شر ما خلق، ومن شر غاسق إذا وقب، ومن شر النفثت فى العقد، ومن شر حاسد إذا حسد.',
    'عدد التكرار': 3,
  },
  'سورة الناس': {
    'النص':
        'بسم الله الرحمن الرحيم\nقل أعوذ برب الناس، ملك الناس، إله الناس، من شر الوسواس الخناس، الذى يوسوس فى صدور الناس، من الجنة والناس.',
    'عدد التكرار': 3,
  },
  'الحديثرقم 1': {
    'النص':
        'لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ المُلْكُ، وَلَهُ الحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ',
    'عدد التكرار': 1,
  },
  'الحديثرقم 2': {'النص': 'سُبْحَانَ اللهِ وَبِحَمْدِهِ', 'عدد التكرار': 100},
  'الحديثرقم 3': {
    'النص':
        'بِسْمِ اللهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ العَلِيمُ',
    'عدد التكرار': 3,
  },
  'الحديثرقم 41': {
    'النص': 'أَعُوذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ',
    'عدد التكرار': 3,
  },
  'الحديثرقم 4': {
    'النص':
        'رَضِيتُ بِاللهِ رَبًّا، وَبِالْإِسْلَامِ دِينًا، وَبِمُحَمَّدٍ ﷺ نَبِيًّا وَرَسُولاً',
    'عدد التكرار': 3,
  },
  'الحديثرقم 5': {
    'النص':
        'حَسْبِيَ اللَّهُ لَا إِلَهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ، وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ',
    'عدد التكرار': 7,
  },
  'الحديثرقم 6': {
    'النص':
        'أَمسَينَا عَلَى فِطْرَةِ الْإِسْلَامِ، وَكَلِمَةِ الْإِخْلَاصِ، وَدِينِ نَبِيِّنَا مُحَمَّدٍ ﷺ، وَمِلَّةِ أَبِينَا إِبْرَاهِيمَ حَنِيفًا مُسْلِمًا وَمَا أَنَا مِنَ الْمُشْرِكِينَ',
    'عدد التكرار': 1,
  },
  'الحديثرقم 7': {
    'النص':
        'أَمسَينَا وَأَمسَى الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ، لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ؛ أَسْأَلُكَ خَيْرَ مَا فِي هَذهِ اللَّيْلَةِ وَخَيْرَ مَا بَعْدَهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذهِ اللَّيْلَةِ وَشَرِّ مَا بَعْدَهَا، رَبِّ؛ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ؛ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ',
    'عدد التكرار': 1,
  },
  'الحديثرقم 8': {
    'النص':
        'اللَّهُمَّ؛ بِكَ أَمسَينَا، وَبِكَ أَصْبَحْنَا وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ المَصِيرُ',
    'عدد التكرار': 1,
  },
  'الحديثرقم 9': {
    'النص':
        'اللَّهُمَّ؛ إِنِّي أَمْسَيْتُ أُشْهِدُكَ وَأُشْهِدُ حَمَلَةَ عَرْشِكَ وَمَلائِكَتَكَ وَجَمِيعَ خَلْقِكَ أَنَّكَ أَنْتَ اللَّهُ لا إِلَهَ إِلا أَنْتَ، وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ',
    'عدد التكرار': 4,
  },
  'الحديثرقم 10': {
    'النص':
        'اللَّهمَّ؛ ما أَمْسَى بِي مِن نِعمَةٍ فَمِنكَ وَحدَكَ لا شَرِيكَ لَك، لَكَ الحَمدُ، ولَكَ الشَّكرُ',
    'عدد التكرار': 1,
  },
  'الحديثرقم 11': {
    'النص':
        'يَا حَيُّ يَا قَيُّومُ؛ بِكَ أَسْتَغِيثُ، فَأَصْلِحْ لِي شَأْنِي كُلَّهُ، وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ',
    'عدد التكرار': 1,
  },
  'الحديثرقم 12': {
    'النص':
        'اللَّهُمَّ؛ عَافِنِي فِي بَدَنِي، اللَّهُمَّ؛ عَافِنِي فِي سَمْعِي، اللَّهُمَّ؛ عَافِنِي فِي بَصَرِي، اللَّهُمَّ؛ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، اللَّهُمَّ؛ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلَهَ إِلَّا أَنْتَ',
    'عدد التكرار': 3,
  },
  'الحديثرقم 13': {
    'النص':
        'اللَّهُمَّ؛ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ، اللَّهُمَّ؛ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي، اللَّهُمَّ؛ اسْتُرْ عَوْرَاتِي، وَآمِنْ رَوْعَاتِي، اللَّهُمَّ؛  احْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِي، وَعَنْ يَمِينِي وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي',
    'عدد التكرار': 1,
  },
  'الحديثرقم 14': {
    'النص':
        'اللَّهُمَّ؛ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَشَرِّ الشَّيْطَانِ وَشِرْكِهِ',
    'عدد التكرار': 1,
  },
  'الحديثرقم 16': {
    'النص':
        'اللَّهُمَّ؛ أَنْتَ رَبِّي، لاَ إِلَهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي؛ فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ',
    'عدد التكرار': 1,
  },
};

const List<String> withNames = [
  'أحمد',
  'أويس',
  'بدر',
  'حازم',
  'خالد',
  'سارية',
  'عبادة',
  'عبيدة',
  'عبدالرحمن أبو سعدة',
  'عبدالرحمن رعد',
  'عروة',
  'عمر',
  'عمرو',
  'فايز',
  'مجد',
  'زيد',
];

const List<String> toNames = [
  'أحمد',
  'أويس',
  'استاذ ابو عبيدة',
  'استاذ عبدالرحمن الخن',
  'بدر',
  'حازم',
  'خالد',
  'سارية',
  'عبادة',
  'عبيدة',
  'عبدالرحمن أبو سعدة',
  'عبدالرحمن رعد',
  'عروة',
  'عمر',
  'عمرو',
  'فايز',
  'فرد من العائلة',
  'مجد',
  'زيد',
  'شخص اخر',
];

const List<String> userNames = [
  'أحمد',
  'أويس',
  'استاذ ابو عبيدة',
  'استاذ عبدالرحمن الخن',
  'بدر',
  'حازم',
  'خالد',
  'سارية',
  'عبادة',
  'عبيدة',
  'عبدالرحمن أبو سعدة',
  'عبدالرحمن رعد',
  'عروة',
  'عمر',
  'عمرو',
  'فايز',
  'مجد',
  'زيد',
];

final List<String> ijazahStudents = [
  'أحمد',
  'أويس',
  'بدر',
  'حازم',
  'خالد',
  'سارية',
  'عبادة',
  'عبيدة',
  'عبدالرحمن أبو سعدة',
  'عبدالرحمن رعد',
  'عروة',
  'عمر',
  'عمرو',
  'فايز',
  'مجد',
  'زيد',
];

final List<String> recitationStudentsName = [
  'أحمد',
  'أويس',
  'بدر',
  'حازم',
  'خالد',
  'سارية',
  'عبادة',
  'عبيدة',
  'عبدالرحمن أبو سعدة',
  'عبدالرحمن رعد',
  'عروة',
  'عمر',
  'عمرو',
  'فايز',
  'مجد',
  'زيد',
];

final List<String> timeFilters = [
  'منذ انشاء التطبيق',
  'اليوم',
  'الأسبوع',
  'الشهر',
  'ثلاثة أشهر',
  'السنة',
];

final Map<String, String> asar = {
  'أتَأْمُرُونَ النَّاسَ بِالْبِرِّ وَتَنْسَوْنَ أَنْفُسَكُمْ': '[البقرة: 44]',
  'ولَكُمْ فِي الْقِصَاصِ حَيَاةٌ يَا أُولِي الْأَلْبَابِ': '[البقرة: 179]',
  'واعْتَصِمُوا بِحَبْلِ اللَّهِ جَمِيعًا وَلَا تَفَرَّقُوا': '[آل عمران: 103]',
  'إنما الأعمال بالنيات': 'حديث',
  'وَلَا تَقْفُ مَا لَيْسَ لَكَ بِهِ عِلْمٌ': '[الإسراء: 36]',
  'الراحمون يرحمهم الرحمن': 'حديث',
  'وَمَنْ أَحْسَنُ قَوْلًا مِمَّنْ دَعَا إِلَى اللَّهِ': '[فصلت: 33]',
  'الدال على الخير كفاعله': 'حديث',
  'وَلَا تَسْتَوِي الْحَسَنَةُ وَلَا السَّيِّئَةُ': '[فصلت: 34]',
  'الصديق مرآة أخيه': 'حكمة إسلامية',
  'إِنَّمَا الْمُؤْمِنُونَ إِخْوَةٌ': '[الحجرات: 10]',
  'تبسمك في وجه أخيك صدقة': 'حديث',
  'يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَسْأَلُوا عَنْ أَشْيَاءَ':
      '[المائدة: 101]',
  'من حسن إسلام المرء تركه ما لا يعنيه': 'حديث',
  'وَلَا تَلْمِزُوا أَنفُسَكُمْ وَلَا تَنَابَزُوا بِالْأَلْقَابِ':
      '[الحجرات: 11]',
  'من لا يَرحم لا يُرحم': 'حديث',
  'يَا أَيُّهَا الَّذِينَ آمَنُوا اجْتَنِبُوا كَثِيرًا مِّنَ الظَّنِّ':
      '[الحجرات: 12]',
  'الرفق لا يكون في شيء إلا زانه': 'حديث',
  'لَا تَدْخُلُوا بُيُوتًا غَيْرَ بُيُوتِكُمْ': '[النور: 27]',
  'خير الناس أنفعهم للناس': 'حديث',
  'لَا تَتَّبِعُوا خُطُوَاتِ الشَّيْطَانِ': '[النور: 21]',
  'الصبر ضياء': 'حديث',
  'قُلْ هَلْ يَسْتَوِي الَّذِينَ يَعْلَمُونَ': '[الزمر: 9]',
  'المؤمن القوي خير وأحب إلى الله من المؤمن الضعيف': 'حديث',
  'إِنَّمَا يُوَفَّى الصَّابِرُونَ أَجْرَهُم': '[الزمر: 10]',
  'إذا لم تستحِ فاصنع ما شئت': 'حديث',
  'مَا يَلْفِظُ مِنْ قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ': '[ق: 18]',
  'الحياء لا يأتي إلا بخير': 'حديث',
  'وَأَمَّا بِنِعْمَةِ رَبِّكَ فَحَدِّثْ': '[الضحى: 11]',
  'الدنيا سجن المؤمن وجنة الكافر': 'حديث',
  'أَلَا يَعْلَمُ مَنْ خَلَقَ': '[الملك: 14]',
  'نعمتان مغبون فيهما كثير من الناس: الصحة والفراغ': 'حديث',
  'خُذِ الْعَفْوَ وَأْمُرْ بِالْعُرْفِ': '[الأعراف: 199]',
  'ليس الشديد بالصرعة، إنما الشديد الذي يملك نفسه عند الغضب': 'حديث',
  'وَقُولُوا لِلنَّاسِ حُسْنًا': '[البقرة: 83]',
  'أفضل الجهاد كلمة حق عند سلطان جائر': 'حديث',
  'يُرِيدُ اللَّهُ بِكُمُ الْيُسْرَ': '[البقرة: 185]',
  'وَاصْبِرْ وَمَا صَبْرُكَ إِلَّا بِاللَّهِ': '[النحل: 127]',
  'كل بني آدم خطاء، وخير الخطائين التوابون': 'حديث',
  'وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْءٍ': '[الأعراف: 156]',
  'إن الله لا ينظر إلى صوركم ولكن إلى قلوبكم وأعمالكم': 'حديث',
  'وَتَوَاصَوْا بِالْحَقِّ وَتَوَاصَوْا بِالصَّبْرِ': '[العصر: 3]',
  'ازهد في الدنيا يحبك الله، وازهد فيما عند الناس يحبك الناس': 'حديث',
  'وَجَعَلْنَاكُمْ شُعُوبًا وَقَبَائِلَ لِتَعَارَفُوا': '[الحجرات: 13]',
  'رحم الله امرءاً عرف قدر نفسه': 'حكمة مأثورة',
  'وَمَا تَفْعَلُوا مِنْ خَيْرٍ فَإِنَّ اللَّهَ بِهِ عَلِيمٌ': '[البقرة: 215]',
  'العقل زينة، والجهل مهانة': 'حكمة عربية',
};
