final Map<String, Map<String, dynamic>> azkarAsbah = {
  'آية الكرسي': {
    'النص':
        'الله لا إله إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يؤوده حفظهما وهو العلي العظيم. [آية الكرسى - البقرة 255]',
    'عدد التكرارات': 1,
  },
  'سورة الإخلاص': {
    'النص':
        'بسم الله الرحمن الرحيم\nقل هو الله أحد، الله الصمد، لم يلد ولم يولد، ولم يكن لهۥ كفوا أحدۢ.',
    'عدد التكرارات': 3,
  },
  'سورة الفلق': {
    'النص':
        'بسم الله الرحمن الرحيم\nقل أعوذ برب الفلق، من شر ما خلق، ومن شر غاسق إذا وقب، ومن شر النفثت فى العقد، ومن شر حاسد إذا حسد.',
    'عدد التكرارات': 3,
  },
  'سورة الناس': {
    'النص':
        'بسم الله الرحمن الرحيم\nقل أعوذ برب الناس، ملك الناس، إله الناس، من شر الوسواس الخناس، الذى يوسوس فى صدور الناس، من الجنة والناس.',
    'عدد التكرارات': 3,
  },
  'الحديث رقم 1': {
    'النص':
        'لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ المُلْكُ، وَلَهُ الحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ',
    'عدد التكرارات': 1,
  },
  'الحديث رقم 2': {
    'النص': 'سُبْحَانَ اللهِ وَبِحَمْدِهِ',
    'عدد التكرارات': 100,
  },
  'الحديث رقم 3': {
    'النص':
        'بِسْمِ اللهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ العَلِيمُ',
    'عدد التكرارات': 3,
  },
  'الحديث رقم 4': {
    'النص':
        'رَضِيتُ بِاللهِ رَبًّا، وَبِالْإِسْلَامِ دِينًا، وَبِمُحَمَّدٍ ﷺ نَبِيًّا وَرَسُولاً',
    'عدد التكرارات': 3,
  },
  'الحديث رقم 5': {
    'النص':
        'حَسْبِيَ اللَّهُ لَا إِلَهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ، وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ',
    'عدد التكرارات': 7,
  },
  'الحديث رقم 6': {
    'النص':
        'أَصْبَحْنَا عَلَى فِطْرَةِ الْإِسْلَامِ، وَكَلِمَةِ الْإِخْلَاصِ، وَدِينِ نَبِيِّنَا مُحَمَّدٍ ﷺ، وَمِلَّةِ أَبِينَا إِبْرَاهِيمَ حَنِيفًا مُسْلِمًا وَمَا أَنَا مِنَ الْمُشْرِكِينَ',
    'عدد التكرارات': 1,
  },
  'الحديث رقم 7': {
    'النص':
        'أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ، لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ؛ أَسْأَلُكَ خَيْرَ مَا فِي هَذا اليوم وَخَيْرَ مَا بَعْدَه، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذا اليوم وَشَرِّ مَا بَعْدَه، رَبِّ؛ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ؛ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ',
    'عدد التكرارات': 1,
  },
  'الحديث رقم 8': {
    'النص':
        'اللَّهُمَّ؛ بِكَ أَصْبَحْنَا، وَبِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ النُّشُورُ',
    'عدد التكرارات': 1,
  },
  'الحديث رقم 9': {
    'النص':
        'اللَّهُمَّ؛ إِنِّي أَصبَحتُ أُشْهِدُكَ وَأُشْهِدُ حَمَلَةَ عَرْشِكَ وَمَلائِكَتَكَ وَجَمِيعَ خَلْقِكَ أَنَّكَ أَنْتَ اللَّهُ لا إِلَهَ إِلا أَنْتَ، وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ',
    'عدد التكرارات': 4,
  },
  'الحديث رقم 10': {
    'النص':
        'اللَّهمَّ؛ ما أصبَحَ بِي مِن نِعمَةٍ فَمِنكَ وَحدَكَ لا شَرِيكَ لَك، لَكَ الحَمدُ، ولَكَ الشَّكرُ',
    'عدد التكرارات': 1,
  },
  'الحديث رقم 11': {
    'النص':
        'يَا حَيُّ يَا قَيُّومُ؛ بِكَ أَسْتَغِيثُ، فَأَصْلِحْ لِي شَأْنِي كُلَّهُ، وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ',
    'عدد التكرارات': 1,
  },
  'الحديث رقم 12': {
    'النص':
        'اللَّهُمَّ؛ عَافِنِي فِي بَدَنِي، اللَّهُمَّ؛ عَافِنِي فِي سَمْعِي، اللَّهُمَّ؛ عَافِنِي فِي بَصَرِي، اللَّهُمَّ؛ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، اللَّهُمَّ؛ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلَهَ إِلَّا أَنْتَ',
    'عدد التكرارات': 3,
  },
  'الحديث رقم 13': {
    'النص':
        'اللَّهُمَّ؛ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ، اللَّهُمَّ؛ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي، اللَّهُمَّ؛ اسْتُرْ عَوْرَاتِي، وَآمِنْ رَوْعَاتِي، اللَّهُمَّ؛  احْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِي، وَعَنْ يَمِينِي وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي',
    'عدد التكرارات': 1,
  },
  'الحديث رقم 14': {
    'النص':
        'اللَّهُمَّ؛ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَشَرِّ الشَّيْطَانِ وَشِرْكِهِ',
    'عدد التكرارات': 1,
  },
  'الحديث رقم 15': {
    'النص':
        'اللَّهُمَّ؛ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا',
    'عدد التكرارات': 1,
  },
  'الحديث رقم 16': {
    'النص':
        'اللَّهُمَّ؛ أَنْتَ رَبِّي، لاَ إِلَهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي؛ فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ',
    'عدد التكرارات': 1,
  },
};

final Map<String, Map<String, dynamic>> azkarAlmasa = {
  'آية الكرسي': {
    'النص':
        'الله لا إله إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يؤوده حفظهما وهو العلي العظيم. [آية الكرسى - البقرة 255]',
    'عدد التكرارات': 1,
  },
  'سورة الإخلاص': {
    'النص':
        'بسم الله الرحمن الرحيم\nقل هو الله أحد، الله الصمد، لم يلد ولم يولد، ولم يكن لهۥ كفوا أحدۢ.',
    'عدد التكرارات': 3,
  },
  'سورة الفلق': {
    'النص':
        'بسم الله الرحمن الرحيم\nقل أعوذ برب الفلق، من شر ما خلق، ومن شر غاسق إذا وقب، ومن شر النفثت فى العقد، ومن شر حاسد إذا حسد.',
    'عدد التكرارات': 3,
  },
  'سورة الناس': {
    'النص':
        'بسم الله الرحمن الرحيم\nقل أعوذ برب الناس، ملك الناس، إله الناس، من شر الوسواس الخناس، الذى يوسوس فى صدور الناس، من الجنة والناس.',
    'عدد التكرارات': 3,
  },
  'الحديث رقم 1': {
    'النص':
        'لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ المُلْكُ، وَلَهُ الحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ',
    'عدد التكرارات': 1,
  },
  'الحديث رقم 2': {
    'النص': 'سُبْحَانَ اللهِ وَبِحَمْدِهِ',
    'عدد التكرارات': 100,
  },
  'الحديث رقم 3': {
    'النص':
        'بِسْمِ اللهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ العَلِيمُ',
    'عدد التكرارات': 3,
  },
  'الحديث رقم 41': {
    'النص': 'أَعُوذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ',
    'عدد التكرارات': 3,
  },
  'الحديث رقم 4': {
    'النص':
        'رَضِيتُ بِاللهِ رَبًّا، وَبِالْإِسْلَامِ دِينًا، وَبِمُحَمَّدٍ ﷺ نَبِيًّا وَرَسُولاً',
    'عدد التكرارات': 3,
  },
  'الحديث رقم 5': {
    'النص':
        'حَسْبِيَ اللَّهُ لَا إِلَهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ، وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ',
    'عدد التكرارات': 7,
  },
  'الحديث رقم 6': {
    'النص':
        'أَمسَينَا عَلَى فِطْرَةِ الْإِسْلَامِ، وَكَلِمَةِ الْإِخْلَاصِ، وَدِينِ نَبِيِّنَا مُحَمَّدٍ ﷺ، وَمِلَّةِ أَبِينَا إِبْرَاهِيمَ حَنِيفًا مُسْلِمًا وَمَا أَنَا مِنَ الْمُشْرِكِينَ',
    'عدد التكرارات': 1,
  },
  'الحديث رقم 7': {
    'النص':
        'أَمسَينَا وَأَمسَى الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ، لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ؛ أَسْأَلُكَ خَيْرَ مَا فِي هَذهِ اللَّيْلَةِ وَخَيْرَ مَا بَعْدَهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذهِ اللَّيْلَةِ وَشَرِّ مَا بَعْدَهَا، رَبِّ؛ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ؛ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ',
    'عدد التكرارات': 1,
  },
  'الحديث رقم 8': {
    'النص':
        'اللَّهُمَّ؛ بِكَ أَمسَينَا، وَبِكَ أَصْبَحْنَا وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ المَصِيرُ',
    'عدد التكرارات': 1,
  },
  'الحديث رقم 9': {
    'النص':
        'اللَّهُمَّ؛ إِنِّي أَمْسَيْتُ أُشْهِدُكَ وَأُشْهِدُ حَمَلَةَ عَرْشِكَ وَمَلائِكَتَكَ وَجَمِيعَ خَلْقِكَ أَنَّكَ أَنْتَ اللَّهُ لا إِلَهَ إِلا أَنْتَ، وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ',
    'عدد التكرارات': 4,
  },
  'الحديث رقم 10': {
    'النص':
        'اللَّهمَّ؛ ما أَمْسَى بِي مِن نِعمَةٍ فَمِنكَ وَحدَكَ لا شَرِيكَ لَك، لَكَ الحَمدُ، ولَكَ الشَّكرُ',
    'عدد التكرارات': 1,
  },
  'الحديث رقم 11': {
    'النص':
        'يَا حَيُّ يَا قَيُّومُ؛ بِكَ أَسْتَغِيثُ، فَأَصْلِحْ لِي شَأْنِي كُلَّهُ، وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ',
    'عدد التكرارات': 1,
  },
  'الحديث رقم 12': {
    'النص':
        'اللَّهُمَّ؛ عَافِنِي فِي بَدَنِي، اللَّهُمَّ؛ عَافِنِي فِي سَمْعِي، اللَّهُمَّ؛ عَافِنِي فِي بَصَرِي، اللَّهُمَّ؛ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، اللَّهُمَّ؛ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلَهَ إِلَّا أَنْتَ',
    'عدد التكرارات': 3,
  },
  'الحديث رقم 13': {
    'النص':
        'اللَّهُمَّ؛ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ، اللَّهُمَّ؛ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي، اللَّهُمَّ؛ اسْتُرْ عَوْرَاتِي، وَآمِنْ رَوْعَاتِي، اللَّهُمَّ؛  احْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِي، وَعَنْ يَمِينِي وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي',
    'عدد التكرارات': 1,
  },
  'الحديث رقم 14': {
    'النص':
        'اللَّهُمَّ؛ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَشَرِّ الشَّيْطَانِ وَشِرْكِهِ',
    'عدد التكرارات': 1,
  },
  'الحديث رقم 16': {
    'النص':
        'اللَّهُمَّ؛ أَنْتَ رَبِّي، لاَ إِلَهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي؛ فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ',
    'عدد التكرارات': 1,
  },
};

const List<String> withNames = [
  'أحمد',
  'أويس',
  'بدر',
  'حازم',
  'خالد',
  'سارية',
  'عبادة',
  'عبيدة',
  'عبدالرحمن أبو سعدة',
  'عبدالرحمن رعد',
  'عروة',
  'عمر',
  'عمرو',
  'فايز',
  'مجد',
  'زيد',
  'شخص اخر',
];

const List<String> toNames = [
  'أحمد',
  'أويس',
  'استاذ ابو عبيدة',
  'استاذ عبدالرحمن الخن',
  'بدر',
  'حازم',
  'خالد',
  'سارية',
  'عبادة',
  'عبيدة',
  'عبدالرحمن أبو سعدة',
  'عبدالرحمن رعد',
  'عروة',
  'عمر',
  'عمرو',
  'فايز',
  'فرد من العائلة',
  'مجد',
  'زيد',
  'شخص اخر',
];

final List<String> ijazahStudents = [
  'أحمد',
  'أويس',
  'بدر',
  'حازم',
  'خالد',
  'سارية',
  'عبادة',
  'عبيدة',
  'عبدالرحمن أبو سعدة',
  'عبدالرحمن رعد',
  'عروة',
  'عمر',
  'عمرو',
  'فايز',
  'مجد',
  'زيد',
];

final List<String> recitationStudentsName = [
  'أحمد',
  'أويس',
  'بدر',
  'حازم',
  'خالد',
  'سارية',
  'عبادة',
  'عبيدة',
  'عبدالرحمن أبو سعدة',
  'عبدالرحمن رعد',
  'عروة',
  'عمر',
  'عمرو',
  'فايز',
  'مجد',
  'زيد',
];

final List<String> timeFilters = [
  'منذ انشاء التطبيق',
  'اليوم',
  'الأسبوع',
  'الشهر',
  'ثلاثة أشهر',
  'السنة',
];
